app/views/articles/_form.html.erb

  <label> Which category this articles belongs to:  </label>
  <%= f.collection_select :category_id, Category.all, :id, :name, prompt: "Select Category" %><br/>
---
SELECT "categories".* FROM "categories"