app/views/articles/index.html.erb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    <%= article.body %><br/>
    <%=  Category.find(article.category_id).name %><br/>