app/views/articles/show.html.erb


   <% if (user_signed_in?) && current_user.id == @article.user_id  && current_user.roles.first['title'] != 'moderator' %>
---
SELECT  "roles".* FROM "roles" INNER JOIN "permissions" ON "roles"."id" = "permissions"."role_id" WHERE "permissions"."user_id" = $1 ORDER BY "roles"."id" ASC LIMIT $2  [["user_id", 2], ["LIMIT", 1]]


<% @article.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = $1  [["article_id", 14]]