app/views/articles/show.html.erb

<% if (user_signed_in?) && (can? :update, Comment.new) %>
  <% @article.comments.each do |c|%>
---
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = $1  [["article_id", 14]]

<%if (user_signed_in?) && (can? :destroy, Comment.new) %>
  <% @article.comments.each do |c|%>
---
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = $1  [["article_id", 15]]

<%else%>
  <% Comment.where(:article_id => @article.id).each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = $1  [["article_id", 7]]