app/controllers/articles_controller.rb

    def update
        @article = Article.find(params[:id])
        @article.title = params["article"]["title"]
        @article.body = params["article"]["body"]
        @article.category_id = params['article']['category_id']
        @article.is_published = params['article']['published_date']
        if @article.publish_date <= Date.today
			@article.is_published = true
		else
			@article.is_published = false
		end
        @article.feature_image_url = params['article']['feature_image_url']
        if @article.save
---
UPDATE "articles" SET "user_id" = $1, "slug" = $2, "updated_at" = $3 WHERE "articles"."id" = $4  [["user_id", 4], ["slug", "film-aff6de6c-1918-49ad-ac0b-74a1b6ba8fba"], ["updated_at", "2020-02-17 04:57:43.034760"], ["id", 7]]

    def destroy
        @article = Article.find(params[:id])
        if @article.destroy
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = $1  [["id", 12]]