app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
---
    def index
        @user = current_user
        @articles = Article.all

INSERT INTO "articles" ("title", "body", "category_id", "publish_date", "feature_image_url", "is_published", "created_at", "updated_at", "slug", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
SELECT  1 AS one FROM "permissions" WHERE "permissions"."user_id" = $1 AND "permissions"."role_id" = $2 LIMIT $3  [["user_id", 13], ["role_id", 3], ["LIMIT", 1]]
INSERT INTO "permissions" ("user_id", "role_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 14], ["role_id", 2], ["created_at", "2020-02-15 07:52:44.631408"], ["updated_at", "2020-02-15 07:52:44.631408"]]
---
    def create

        @article = Article.friendly.new(article_params)
        @article.user_id = current_user.id
        @article.feature_image_url = params['article']['feature_image_url']
        if @article.publish_date <= Date.today
			    @article.is_published = true
		    else
			    @article.is_published = false
        end
        if @article.save
            if not current_user.permissions.exists?(role_id:3) and not current_user.permissions.exists?(role_id:2)
                @permission = Permission.new
                @permission.user_id = current_user.id
                @permission.role_id = 3
                if not @permission.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
UPDATE "articles" SET "feature_image_url" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["feature_image_url", nil], ["updated_at", "2020-02-17 07:44:01.865198"], ["id", 35]]
---
    def update

        @article = Article.friendly.find(params[:id])
        @article.title = params['article']['title']
        @article.body = params['article']['body']
        @article.category_id = params['article']['category_id']
        @article.publish_date = params['article']['publish_date']
        @article.user_id = current_user.id
        if not params['article']['feature_image_url'].nil?
            @article.feature_image_url = params['article']['feature_image_url']
          end
          if @article.publish_date <= Date.today
            @article.is_published = true
          elsif @article.publish_date > Date.today
            @article.is_published = false
          end

       if @article.save

DELETE FROM "articles" WHERE "articles"."id" = $1  [["id", 13]]
---
    def destroy
        if @article.destroy

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 35], ["LIMIT", 1]]
---
  def set_article
	@article = Article.friendly.find(params[:id])