app/controllers/categories_controller.rb

	def create
        @category=Category.new
        @category.name = params["category"]["name"]
        @category.description = params["category"]["description"]
        if @category.save
---
INSERT INTO "categories" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"

	def update
		@category = Category.find(params[:id])
		@category.name = params['category']['name']
		@category.description = params['category']['description']
		if @category.save
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "categories" SET "name" = $1, "updated_at" = $2 WHERE "categories"."id" = $3  [["name", "Fitness"], ["updated_at", "2020-02-10 17:28:59.882759"], ["id", 1]]