app/controllers/comments_controller.rb

INSERT INTO "comments" ("title", "body", "article_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "eeeelu"], ["body", "eeelu"], ["article_id", 10], ["user_id", 11], ["created_at", "2020-02-14 09:25:44.237710"], ["updated_at", "2020-02-14 09:25:44.237710"]]
---
   def create
     @comment = Comment.new(comment_params)
     @comment.user_id = current_user.id
    #  binding.pry
    #  @comment.article_id = Article.article_id
     if @comment.save

UPDATE "comments" SET "title" = $1, "body" = $2, "updated_at" = $3 WHERE "comments"."id" = $4  [["title", "is it"], ["body", "working"], ["updated_at", "2020-02-15 07:38:27.732213"], ["id", 15]]
---
        def update
            @comment.title = params['comment']['title']
            @comment.body = params['comment']['body']
            if @comment.save

DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 17]]
---
        def destroy
            if @comment.destroy

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
---
        def set_article
            @comment = Comment.find(params[:id])