app/models/ability.rb

SELECT "roles"."title" FROM "roles" INNER JOIN "permissions" ON "roles"."id" = "permissions"."role_id" WHERE "permissions"."user_id" = $1  [["user_id", 2]]
SELECT "roles"."title" FROM "roles" INNER JOIN "permissions" ON "roles"."id" = "permissions"."role_id" WHERE "permissions"."user_id" = $1  [["user_id", 8]]
SELECT "roles"."title" FROM "roles" INNER JOIN "permissions" ON "roles"."id" = "permissions"."role_id" WHERE "permissions"."user_id" = $1  [["user_id", 11]]
---
  def initialize(user)
    if user.nil?
      can :read, [Category, Article]
    elsif user.roles.pluck(:title).include? "admin"
      can :manage, [Category, Article, Comment]
    elsif user.roles.pluck(:title).include? "moderator"
      can :read, [Category, Article, Comment]
      can :create, Comment
      can :destroy, Comment
    elsif user.roles.pluck(:title).include? "author"
      can :read, [Category, Article, Comment]
      can :create, Article
      can [:update, :destroy], Article do |art|
      art.user_id == user.id
      end
      can :destroy, Comment do |c|
      c.user_id == user.id
      end
    elsif user.roles.pluck(:title).include? "user"