app/models/user.rb

  def assign_user_role
    Permission.create(user_id:self.id, role_id:Role.last.id)
---
INSERT INTO "permissions" ("user_id", "role_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 15], ["role_id", 4], ["created_at", "2020-02-16 13:08:02.012759"], ["updated_at", "2020-02-16 13:08:02.012759"]]
SELECT  "roles".* FROM "roles" ORDER BY "roles"."id" DESC LIMIT $1  [["LIMIT", 1]]

  def self.find_for_database_authentication warder_condition
---
SELECT  "users".* FROM "users" WHERE (lower(username) = 'user' OR lower(email) = 'user') ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]