app/views/categories/index.html.erb

SELECT "articles".* FROM "articles" WHERE "articles"."category_id" = $1  [["category_id", 2]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."category_id" = $1  [["category_id", 2]]
---
<% @categories.each_with_index do |p,index| %>
  <%= link_to p.name, category_path(p.id) %>  (<%= p.articles.count %> articles)<br/>